# Cable Type Core Type Property

Source: https://www.revitapidocs.com/2026/07baf32c-d991-4815-0294-5fee8776fe14.htm

---

| Cable Type Core Type Property |
| --- |

The core type of the cable type.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public CoreType CoreType { get; set; }
```

```
Public Property CoreType As CoreType
	Get
	Set
```

```
public:
property CoreType CoreType {
	CoreType get ();
	void set (CoreType value);
}
```

```
member CoreType : CoreType with get, set
```

#### Property Value

CoreType Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

Remarks It is single core by default. See Also

#### Reference

CableType Class Autodesk.Revit.DB.Electrical Namespace